Repository: mubtAAhij/CodeEdit
Catalog: CodeEdit/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fr_fr, zh_cn

# lsp.removing-package
source: Removing %@
es_419: Eliminando %@
fr_fr: Suppression de %@
zh_cn: 正在移除 %@

# lsp.installing-package
source: Installing %@
es_419: Instalando %@
fr_fr: Installation de %@
zh_cn: 正在安装 %@

# lsp.install-failed
source: Could not install %@
es_419: No se pudo instalar %@
fr_fr: Impossible d'installer %@
zh_cn: 无法安装 %@

# lsp.install-problem
source: There was a problem during installation.
es_419: Hubo un problema durante la instalación.
fr_fr: Un problème est survenu lors de l'installation.
zh_cn: 安装过程中出现问题。

# lsp.install-success
source: Successfully installed %@
es_419: Se instaló %@ correctamente
fr_fr: %@ installé avec succès
zh_cn: 已成功安装 %@

# status-bar.no-selection
source: No Selection
es_419: Sin selección
fr_fr: Aucune sélection
zh_cn: 未选择

# status-bar.selected-ranges
source: %d selected ranges
es_419: %d rangos seleccionados
fr_fr: %d plages sélectionnées
zh_cn: 已选择 %d 个范围

# status-bar.char-location-length
source: Char: %ld Len: %ld
es_419: Car: %ld Long: %ld
fr_fr: Car : %ld Long : %ld
zh_cn: 字符: %ld 长度: %ld

# status-bar.lines
source: %d lines
es_419: %d líneas
fr_fr: %d lignes
zh_cn: %d 行

# status-bar.characters
source: %ld characters
es_419: %ld caracteres
fr_fr: %ld caractères
zh_cn: %ld 个字符

# status-bar.char-location-zero
source: Char: %ld Len: 0
es_419: Car: %ld Long: 0
fr_fr: Car : %ld Long : 0
zh_cn: 字符: %ld 长度: 0

# status-bar.cursor
source: Line: %ld Col: %ld
es_419: Línea: %ld Col: %ld
fr_fr: Lig : %ld Col : %ld
zh_cn: 行: %ld 列: %ld

# find.menu
source: Find
es_419: Buscar
fr_fr: Rechercher
zh_cn: 查找

# find.find
source: Find...
es_419: Buscar...
fr_fr: Rechercher...
zh_cn: 查找...

# find.find-replace
source: Find and Replace...
es_419: Buscar y reemplazar...
fr_fr: Rechercher et remplacer...
zh_cn: 查找和替换...

# find.find-next
source: Find Next
es_419: Buscar siguiente
fr_fr: Suivant
zh_cn: 查找下一个

# find.find-previous
source: Find Previous
es_419: Buscar anterior
fr_fr: Rechercher le précédent
zh_cn: 查找上一个

# find.use-selection
source: Use Selection for Find
es_419: Usar selección para buscar
fr_fr: Utiliser la sélection pour la recherche
zh_cn: 将所选项用于查找

# find.jump-to-selection
source: Jump to Selection
es_419: Ir a la selección
fr_fr: Aller à la sélection
zh_cn: 跳转到所选项

# source-control.push.header
source: Push local changes to
es_419: Hacer push de cambios locales a
fr_fr: Pusher les modifications locales vers
zh_cn: 推送本地更改到

# source-control.push.force
source: Force
es_419: Forzar
fr_fr: Forcer
zh_cn: 强制

# source-control.push.include-tags
source: Include Tags
es_419: Incluir etiquetas
fr_fr: Inclure les étiquettes
zh_cn: 包含标签

# source-control.push.pushing
source: Pushing changes...
es_419: Haciendo push de cambios...
fr_fr: Push des modifications en cours...
zh_cn: 正在推送更改...

# source-control.push.failed
source: Failed to push
es_419: No se pudo hacer push
fr_fr: Échec du push
zh_cn: 推送失败

# source-control.rename-branch.from
source: From
es_419: Desde
fr_fr: Depuis
zh_cn: 从

# source-control.rename-branch.to
source: To
es_419: A
fr_fr: Vers
zh_cn: 至

# source-control.rename-branch.title
source: Rename branch
es_419: Renombrar rama
fr_fr: Renommer la branche
zh_cn: 重命名分支

# source-control.rename-branch.description
source: All uncommited changes will be preserved on the renamed branch.
es_419: Todos los cambios no confirmados se preservarán en la rama renombrada.
fr_fr: Toutes les modifications non validées seront préservées sur la branche renommée.
zh_cn: 所有未提交的更改将保留在重命名后的分支上。

# source-control.rename-branch.button
source: Rename
es_419: Renombrar
fr_fr: Renommer
zh_cn: 重命名

# source-control.rename-branch.failed
source: Failed to create branch
es_419: No se pudo crear la rama
fr_fr: Échec de la création de la branche
zh_cn: 创建分支失败

# source-control.no-tracked-branch
source: No tracked branch for '%@'
es_419: No hay rama rastreada para '%@'
fr_fr: Aucune branche suivie pour '%@'
zh_cn: '%@' 无跟踪分支

# source-control.push-ellipsis
source: Push...
fr_fr: Pusher...
zh_cn: 推送...

# source-control.commits-ahead
source: %d ahead
es_419: %d adelante
fr_fr: %d en avance
zh_cn: 领先 %d

# source-control.commits-behind
source: %d behind
es_419: %d atrás
fr_fr: %d de retard
zh_cn: 落后 %d 个提交

# source-control.new-branch.from
source: From
es_419: Desde
fr_fr: Depuis
zh_cn: 来源分支

# source-control.new-branch.to
source: To
es_419: A
fr_fr: Vers
zh_cn: 至

# source-control.new-branch.title
source: Create a new branch
es_419: Crear una rama nueva
fr_fr: Créer une nouvelle branche
zh_cn: 创建新分支

# source-control.new-branch.description
source: Create a branch from the current branch and switch to it. All uncommited changes will be preserved on the new branch.
es_419: Crea una rama desde la rama actual y cambia a ella. Todos los cambios no confirmados se preservarán en la rama nueva.
fr_fr: Créer une branche depuis la branche actuelle et basculer dessus. Toutes les modifications non validées seront préservées sur la nouvelle branche.
zh_cn: 从当前分支创建一个分支并切换到该分支。所有未提交的更改将保留在新分支上。

# source-control.new-branch.button
source: Create
es_419: Crear
fr_fr: Créer
zh_cn: 创建

# source-control.new-branch.failed
source: Failed to create branch
es_419: No se pudo crear la rama
fr_fr: Échec de la création de la branche
zh_cn: 创建分支失败

# command.quick-open
source: Quick Open
es_419: Apertura rápida
fr_fr: Ouverture rapide
zh_cn: 快速打开

# command.quick-open.title
source: Quick Open
es_419: Apertura rápida
fr_fr: Ouverture rapide
zh_cn: 快速打开

# command.toggle-navigator
source: Toggle Navigator
es_419: Alternar navegador
fr_fr: Afficher/Masquer le navigateur
zh_cn: 切换导航器

# command.toggle-navigator.title
source: Toggle Navigator
es_419: Alternar navegador
fr_fr: Afficher/Masquer le navigateur
zh_cn: 切换导航器

# command.toggle-inspector
source: Toggle Inspector
es_419: Alternar Inspector
fr_fr: Afficher/masquer l'inspecteur
zh_cn: 切换检查器

# command.toggle-inspector.title
source: Toggle Inspector
es_419: Alternar Inspector
fr_fr: Afficher/masquer l'inspecteur
zh_cn: 切换检查器

# workspace-settings.title
source: Workspace Settings
es_419: Configuración del área de trabajo
fr_fr: Réglages de l'espace de travail
zh_cn: 工作区设置

# pip.initialize
source: Initialize Directory Structure
es_419: Inicializar estructura de directorios
fr_fr: Initialiser la structure de répertoires
zh_cn: 初始化目录结构

# pip.install-package
source: Install Package Using pip
es_419: Instalar paquete usando pip
fr_fr: Installer le paquet avec pip
zh_cn: 使用 pip 安装包

# pip.install-confirmation
source: This requires the pip package %@. Allow CodeEdit to install this package?
es_419: Esto requiere el paquete de pip %@. ¿Permitir que CodeEdit instale este paquete?
fr_fr: Cela nécessite le paquet pip %@. Autoriser CodeEdit à installer ce paquet ?
zh_cn: 这需要 pip 包 %@。 允许 CodeEdit 安装此包？

# pip.update-requirements
source: Update requirements.txt
es_419: Actualizar requirements.txt
fr_fr: Mettre à jour requirements.txt
zh_cn: 更新 requirements.txt

# pip.writing-requirements
source: Writing requirements to requirements.txt
es_419: Escribiendo requisitos en requirements.txt
fr_fr: Écriture des dépendances dans requirements.txt
zh_cn: 正在写入依赖项到 requirements.txt

# pip.verify-installation
source: Verify Installation
es_419: Verificar instalación
fr_fr: Vérifier l'installation
zh_cn: 验证安装

# pip.package-not-found
source: Package %@ not found in pip list
es_419: Paquete %@ no encontrado en pip list
fr_fr: Paquet %@ introuvable dans pip list
zh_cn: 在 pip list 中找不到包 %@

# task.finished-running-message
source: Finished running %@.
es_419: Se finalizó la ejecución de %@.
fr_fr: Exécution de %@ terminée.
zh_cn: 已完成运行 %@。

# task.finished-running-title
source: Finished Running %@
es_419: Ejecución de %@ finalizada
fr_fr: Exécution de %@ terminée
zh_cn: %@ 运行完成

# task.cancelled-message
source: %@ cancelled.
es_419: %@ cancelado.
fr_fr: %@ annulé.
zh_cn: %@ 已取消。

# task.cancelled-title
source: %@ cancelled
es_419: %@ cancelado
fr_fr: %@ annulé
zh_cn: %@ 已取消

# task.failed-to-run-message
source: Failed to run %@
es_419: No se pudo ejecutar %@
fr_fr: Échec de l'exécution de %@
zh_cn: 运行 %@ 失败

# task.failed-running-title
source: Failed Running %@
es_419: No se pudo ejecutar %@
fr_fr: Échec de l'exécution de %@
zh_cn: 运行 %@ 失败

# task.running-title
source: Running %@
es_419: Ejecutando %@
fr_fr: Exécution de %@
zh_cn: 正在运行 %@

# task.running-message
source: Running your task: %@.
es_419: Ejecutando tu tarea: %@.
fr_fr: Exécution de votre tâche : %@.
zh_cn: 正在运行你的任务:%@。

# tasks.menu
source: Tasks
es_419: Tareas
fr_fr: Tâches
zh_cn: 任务

# tasks.no-selected
source: (No Selected Task)
es_419: (Ninguna tarea seleccionada)
fr_fr: (Aucune tâche sélectionnée)
zh_cn: (未选择任务)

# tasks.run
source: Run %@
es_419: Ejecutar %@
fr_fr: Exécuter %@
zh_cn: 运行 %@

# tasks.show-output
source: Show %@ Output
es_419: Mostrar salida de %@
fr_fr: Afficher la sortie %@
zh_cn: 显示 %@ 输出

# tasks.choose-task
source: Choose Task...
es_419: Elegir tarea...
fr_fr: Choisir une tâche...
zh_cn: 选择任务…

# tasks.manage-tasks
source: Manage Tasks...
es_419: Administrar tareas...
fr_fr: Gérer les tâches...
zh_cn: 管理任务……

# ssh.create-key
source: Create SSH key
es_419: Crear clave SSH
fr_fr: Créer une clé SSH
zh_cn: 创建 SSH 密钥

# ssh.key-type
source: Key Type
es_419: Tipo de Clave
fr_fr: Type de clé
zh_cn: 密钥类型

# ssh.less-secure-dsa
source: (less secure)
es_419: (menos seguro)
fr_fr: (moins sécurisé)
zh_cn: (安全性较低)

# ssh.passphrase
source: Passphrase
es_419: Frase de contraseña
fr_fr: Phrase de passe
zh_cn: 密码短语

# ssh.confirm-passphrase
source: Confirm Passphrase
es_419: Confirmar frase de contraseña
fr_fr: Confirmer la phrase secrète
zh_cn: 确认密码短语

# ssh.create
source: Create
es_419: Crear
fr_fr: Créer
zh_cn: 创建

# developer.language
source: Language
es_419: Lenguaje
fr_fr: Langage
zh_cn: 语言

# developer.lsp-path
source: Language Server Path
es_419: Ruta del Servidor de Lenguaje
fr_fr: Chemin du serveur de langage
zh_cn: 语言服务器路径

# developer.add-lsp-instruction
source: Add a language server
es_419: Agregar un servidor de lenguaje
fr_fr: Ajouter un serveur de langage
zh_cn: 添加语言服务器

# developer.add-lsp-title
source: Add a language server
es_419: Agregar un servidor de lenguaje
fr_fr: Ajouter un serveur de langage
zh_cn: 添加语言服务器

# developer.add-lsp-description
source: Specify the absolute path to your LSP binary and its associated language.
es_419: Especifica la ruta absoluta a tu binario LSP y su lenguaje asociado.
fr_fr: Spécifiez le chemin absolu vers votre binaire LSP et son langage associé.
zh_cn: 指定 LSP 二进制文件的绝对路径及其关联的语言。

# developer.lsp-binaries-description
source: Specify the language and the absolute path to the language server binary.
es_419: Especifica el lenguaje y la ruta absoluta al binario del servidor de lenguaje.
fr_fr: Spécifiez le langage et le chemin absolu vers le binaire du serveur de langage.
zh_cn: 指定语言和语言服务器二进制文件的绝对路径。

# find.results-summary
source: %d results in %d files
es_419: %d resultados en %d archivos
fr_fr: %d résultats dans %d fichiers
zh_cn: %d 条结果分布在 %d 个文件中

# find.searching
source: Searching
es_419: Buscando
fr_fr: Recherche en cours
zh_cn: 搜索中

# find.replacing
source: Replacing
es_419: Reemplazando
fr_fr: Remplacement en cours
zh_cn: 正在替换

# find.no-results
source: No Results
es_419: Sin resultados
fr_fr: Aucun résultat
zh_cn: 无结果

# find.no-results-description
source: No Results for "%@" in Project
es_419: No hay resultados para \"%@\" en el proyecto
fr_fr: Aucun résultat pour \"%@\" dans le projet
zh_cn: 项目中未找到\"%@\"的结果

# find.replaced
source: Replaced
es_419: Reemplazado
fr_fr: Remplacé
zh_cn: 已替换

# find.replaced-description
source: Successfully replaced terms across %d files
es_419: Términos reemplazados exitosamente en %d archivos
fr_fr: Remplacement réussi dans %d fichiers
zh_cn: 已在 %d 个文件中成功替换搜索词

# find.error
source: An Error Occurred
es_419: Ocurrió un error
fr_fr: Une erreur s'est produite
zh_cn: 发生错误

# source-control.repo.switch
source: Switch...
es_419: Cambiar...
fr_fr: Basculer...
zh_cn: 切换...

# source-control.repo.new-branch
source: New Branch...
es_419: Rama nueva...
fr_fr: Nouvelle branche...
zh_cn: 新建分支...

# source-control.repo.new-branch-from
source: New Branch from "%@"...
es_419: Rama nueva desde \"%@\"...
fr_fr: Nouvelle branche depuis \"%@\"...
zh_cn: 从\"%@\"新建分支...

# source-control.repo.rename-branch
source: Rename Branch...
es_419: Renombrar rama...
fr_fr: Renommer la branche...
zh_cn: 重命名分支...

# source-control.repo.rename-branch-named
source: Rename "%@"...
es_419: Renombrar \"%@\"...
fr_fr: Renommer « %@ »…
zh_cn: 重命名\"%@\"…

# source-control.repo.add-remote
source: Add Existing Remote...
es_419: Agregar remoto existente...
fr_fr: Ajouter un distant existant...
zh_cn: 添加现有远程...

# source-control.repo.apply-stash
source: Apply Stashed Changes...
es_419: Aplicar cambios del stash...
fr_fr: Appliquer la remise...
zh_cn: 应用贮藏的更改...

# source-control.repo.delete
source: Delete...
es_419: Eliminar...
fr_fr: Supprimer...
zh_cn: 删除...

# theme.choose
source: Choose
es_419: Elegir
fr_fr: Choisir
zh_cn: 选择

# theme.details
source: Details...
es_419: Detalles...
fr_fr: Détails...
zh_cn: 详情...

# theme.duplicate
source: Duplicate...
es_419: Duplicar...
fr_fr: Dupliquer...
zh_cn: 复制…

# theme.export-ellipsis
source: Export...
es_419: Exportar...
fr_fr: Exporter...
zh_cn: 导出...

# theme.delete
source: Delete...
es_419: Eliminar...
fr_fr: Supprimer...
zh_cn: 删除...

# theme.delete-button
source: Delete Theme
es_419: Eliminar tema
fr_fr: Supprimer le thème
zh_cn: 删除主题

# theme.delete-warning
source: This action cannot be undone.
es_419: Esta acción no se puede deshacer.
fr_fr: Cette action est irréversible.
zh_cn: 此操作无法撤销。

# navigate.menu
source: Navigate
es_419: Navegar
fr_fr: Naviguer
zh_cn: 导航

# navigate.reveal-in-project
source: Reveal in Project Navigator
es_419: Mostrar en el navegador de proyectos
fr_fr: Révéler dans le navigateur de projet
zh_cn: 在项目导航器中显示

# navigate.reveal-changes
source: Reveal Changes in Navigator
es_419: Mostrar cambios en el navegador
fr_fr: Révéler les modifications dans le navigateur
zh_cn: 在导航器中显示更改

# navigate.open-in-next
source: Open in Next Editor
es_419: Abrir en siguiente editor
fr_fr: Ouvrir dans l'éditeur suivant
zh_cn: 在下一个编辑器中打开

# navigate.open-in
source: Open in...
es_419: Abrir en...
fr_fr: Ouvrir dans...
zh_cn: 在...中打开

# navigate.previous-tab
source: Show Previous Tab
es_419: Mostrar pestaña anterior
fr_fr: Afficher l'onglet précédent
zh_cn: 显示上一个标签页

# navigate.next-tab
source: Show Next Tab
es_419: Mostrar pestaña siguiente
fr_fr: Afficher l'onglet suivant
zh_cn: 显示下个标签页

# navigate.go-forward
source: Go Forward
es_419: Avanzar
fr_fr: Avancer
zh_cn: 前进

# navigate.go-back
source: Go Back
es_419: Volver
fr_fr: Retour
zh_cn: 返回

# commit.copy-message
source: Copy Commit Message
es_419: Copiar mensaje de commit
fr_fr: Copier le message de commit
zh_cn: 复制提交消息

# commit.copy-identifier
source: Copy Identifier
es_419: Copiar identificador
fr_fr: Copier l'identifiant
zh_cn: 复制标识符

# commit.tag
source: Tag %@...
es_419: Etiquetar %@...
fr_fr: Étiqueter %@...
zh_cn: 标记 %@...

# commit.new-branch-from
source: New Branch from %@...
es_419: Rama nueva desde %@...
fr_fr: Nouvelle branche depuis %@...
zh_cn: 从 %@ 新建分支...

# commit.view-on-remote
source: View on %@...
es_419: Ver en %@...
fr_fr: Afficher sur %@...
zh_cn: 在 %@ 上查看...

# commit.checkout
source: Check Out %@...
es_419: Realizar Checkout de %@...
fr_fr: Extraire %@...
zh_cn: 检出 %@...

# commit.help
source: History Editor Help
es_419: Ayuda del editor de historial
fr_fr: Aide de l'éditeur d'historique
zh_cn: 历史记录编辑器帮助

# theme.search
source: Search
es_419: Búsqueda
fr_fr: Recherche
zh_cn: 搜索

# theme.create-new
source: Create a new Theme
es_419: Crear un tema nuevo
fr_fr: Créer un nouveau thème
zh_cn: 创建新主题

# theme.export-all
source: Export All Custom Themes...
es_419: Exportar Todos los Temas Personalizados...
fr_fr: Exporter tous les thèmes personnalisés...
zh_cn: 导出所有自定义主题...

# theme.import-export-help
source: Import or Export Custom Themes
es_419: Importar o Exportar Temas Personalizados
fr_fr: Importer ou exporter des thèmes personnalisés
zh_cn: 导入或导出自定义主题

# theme.import-ellipsis
source: Import...
es_419: Importar...
fr_fr: Importer...
zh_cn: 导入...

# find-replace.no-files-matched
source: No files in the workspace matched: %@
es_419: No se encontraron archivos en el área de trabajo que coincidan con: %@
fr_fr: Aucun fichier de l'espace de travail ne correspond à : %@
zh_cn: 工作区中没有文件匹配：%@

# find-replace.all-failed
source: All files failed to update. (%d) errors occurred. Check logs for more information
es_419: No se pudo actualizar ningún archivo. Ocurrieron (%d) errores. Revisa los registros para más información
fr_fr: Échec de la mise à jour de tous les fichiers. (%d) erreurs se sont produites. Consultez les logs pour plus d'informations
zh_cn: 所有文件更新失败。发生了 (%d) 个错误。请检查日志以获取更多信息

# find-replace.partial-success
source: %d successfully updated, %d errors occurred. Please check logs for more information.
es_419: %d actualizados correctamente, %d errores ocurrieron. Consulta los registros para más información.
fr_fr: %d mis à jour avec succès, %d erreurs survenues. Consultez les journaux pour plus d'informations.
zh_cn: 已成功更新 %d 项，发生 %d 个错误。请检查日志以获取更多信息。

# common.error
source: Error
fr_fr: Erreur
zh_cn: 错误

# find-replace.read-error
source: An error occurred while reading file contents of: %@
es_419: Ocurrió un error al leer el contenido del archivo: %@
fr_fr: Une erreur s'est produite lors de la lecture du contenu du fichier : %@
zh_cn: 读取文件内容时发生错误：%@

# find-replace.write-error
source: An error occurred while writing to: %@
es_419: Ocurrió un error al escribir en: %@
fr_fr: Une erreur s'est produite lors de l'écriture dans : %@
zh_cn: 写入时发生错误：%@

# find-navigator.scoped
source: Scoped
es_419: Con alcance
fr_fr: Ciblé
zh_cn: 限定范围

# find-navigator.match-case
source: Match Case
es_419: Coincidir mayúsculas y minúsculas
fr_fr: Respecter la casse
zh_cn: 区分大小写

# find-navigator.with
source: With
es_419: Con
fr_fr: Avec
zh_cn: 包含

# find-navigator.preserve-case
source: Preserve Case
es_419: Preservar mayúsculas y minúsculas
fr_fr: Respecter la casse
zh_cn: 保留大小写

# find-navigator.only-in-folders
source: Only in folders
es_419: Solo en carpetas
fr_fr: Uniquement dans les dossiers
zh_cn: 仅在文件夹中

# find-navigator.open-editors-only
source: Search only in Open Editors
es_419: Buscar solo en editores abiertos
fr_fr: Rechercher uniquement dans les éditeurs ouverts
zh_cn: 仅在打开的编辑器中搜索

# find-navigator.excluding-folders
source: Excluding folders
es_419: Excluyendo carpetas
fr_fr: Exclusion de dossiers
zh_cn: 排除文件夹

# find-navigator.use-exclude-settings
source: Use Exclude Settings and Ignore Files
es_419: Usar configuración de exclusión y archivos ignorados
fr_fr: Utiliser les réglages d'exclusion et les fichiers ignore
zh_cn: 使用排除设置和忽略文件

# find-navigator.replace-all
source: Replace All
es_419: Reemplazar todo
fr_fr: Tout remplacer
zh_cn: 全部替换

# file-manager.error.file-not-found
source: File not found
es_419: Archivo no encontrado
fr_fr: Fichier introuvable
zh_cn: 找不到文件

# file-manager.error.file-not-found-in-codeedit
source: File not found in CodeEdit
es_419: Archivo no encontrado en CodeEdit
fr_fr: Fichier introuvable dans CodeEdit
zh_cn: 在 CodeEdit 中找不到文件

# file-manager.error.failed-to-find-origin
source: Failed to find origin file
es_419: No se pudo encontrar el archivo de origen
fr_fr: Impossible de trouver le fichier d'origine
zh_cn: 找不到源文件

# file-manager.error.destination-exists
source: Destination already exists
es_419: El destino ya existe
fr_fr: La destination existe déjà
zh_cn: 目标已存在

# file-manager.error.invalid-filename
source: Invalid file name
es_419: Nombre de archivo inválido
fr_fr: Nom de fichier invalide
zh_cn: 文件名无效

# file-manager.error.recovery-reopen
source: Reopen the workspace to reindex the file system.
es_419: Vuelve a abrir el área de trabajo para reindexar el sistema de archivos.
fr_fr: Rouvrez l'espace de travail pour réindexer le système de fichiers.
zh_cn: 重新打开工作区以重建文件系统索引。

# file-manager.error.recovery-retry
source: The file may have moved during the operation, try again.
es_419: Es posible que el archivo se haya movido durante la operación, intenta de nuevo.
fr_fr: Le fichier a peut-être été déplacé pendant l'opération, réessayez.
zh_cn: 文件可能在操作过程中已移动，请重试。

# file-manager.error.recovery-rename
source: Use a different file name or remove the conflicting file.
es_419: Usa un nombre de archivo diferente o elimina el archivo en conflicto.
fr_fr: Utilisez un autre nom de fichier ou supprimez le fichier en conflit.
zh_cn: 使用不同的文件名或移除冲突的文件。

# file-manager.error.recovery-invalid-name
source: File names must not contain the : character and be less than 256 characters.
es_419: Los nombres de archivo no deben contener el carácter : ni superar los 256 caracteres.
fr_fr: Les noms de fichier ne doivent pas contenir le caractère : et doivent comporter moins de 256 caractères.
zh_cn: 文件名不得包含 : 字符，且长度必须少于 256 个字符。

# file-manager.delete-confirmation.message
source: Do you want to delete "%@"?
es_419: ¿Quieres eliminar \"%@\"?
fr_fr: Voulez-vous supprimer « %@ » ?
zh_cn: 要删除\"%@\"吗?

# file-manager.delete-confirmation.info
source: This item will be deleted immediately. You can't undo this action.
es_419: Este elemento se eliminará de inmediato. No puedes deshacer esta acción.
fr_fr: Cet élément sera supprimé immédiatement. Cette action est irréversible.
zh_cn: 此项目将立即删除。此操作无法撤销。

# file-manager.delete-multiple.message
source: Are you sure you want to delete the %d selected items?
es_419: ¿Estás seguro de que quieres eliminar los %d elementos seleccionados?
fr_fr: Voulez-vous vraiment supprimer les %d éléments sélectionnés ?
zh_cn: 确定要删除所选的 %d 个项目吗?

# file-manager.delete-multiple.info
source: %d items will be deleted immediately. You cannot undo this action.
es_419: %d elementos se eliminarán de forma permanente. No puedes deshacer esta acción.
fr_fr: %d éléments seront supprimés immédiatement. Cette action est irréversible.
zh_cn: %d 个项目将立即删除。此操作无法撤销。

# file-manager.duplicate-name
source: %@ copy%@
es_419: %@ copia%@
fr_fr: %@ copie%@
zh_cn: %@ 拷贝%@

# npm.require-permission
source: This package requires npm to install. Allow CodeEdit to run npm commands?
es_419: Este paquete requiere npm para instalarse. ¿Permitir que CodeEdit ejecute comandos de npm?
fr_fr: Ce paquet nécessite npm pour s'installer. Autoriser CodeEdit à exécuter des commandes npm ?
zh_cn: 此包需要 npm 才能安装。是否允许 CodeEdit 运行 npm 命令？

# npm.initialize-directory
source: Initialize Directory Structure
es_419: Inicializar estructura de directorios
fr_fr: Initialiser la structure de répertoires
zh_cn: 初始化目录结构

# npm.this-package
source: this package
es_419: este paquete
fr_fr: ce paquet
zh_cn: 此包

# npm.these-packages
source: these packages
es_419: estos paquetes
fr_fr: ces paquets
zh_cn: 这些包

# npm.install-package
source: Install Package Using npm
es_419: Instalar paquete usando npm
fr_fr: Installer le paquet avec npm
zh_cn: 使用 npm 安装包

# npm.install-confirmation
source: This requires the npm package%@ %@. Allow CodeEdit to install %@?
es_419: Esto requiere el paquete de npm%@ %@. ¿Permitir que CodeEdit instale %@?
fr_fr: Cela nécessite le paquet npm%@ %@. Autoriser CodeEdit à installer %@ ?
zh_cn: 这需要 npm 包%@%@。 允许 CodeEdit 安装%@？

# npm.verify-installation
source: Verify Installation
es_419: Verificar instalación
fr_fr: Vérifier l'installation
zh_cn: 验证安装

# npm.package-not-found-in-json
source: Package not found in package.json
es_419: Paquete no encontrado en package.json
fr_fr: Paquet introuvable dans package.json
zh_cn: 在 package.json 中找不到包

# npm.version-mismatch
source: Version mismatch: Expected %@, but found %@
es_419: Versión no coincide: se esperaba %@, pero se encontró %@
fr_fr: Incompatibilité de version : %@ attendu, %@ trouvé
zh_cn: 版本不匹配：期望 %@，但找到 %@
